package javabase.ch13;

//하나의 쓰레드가 2가지 작업을 연속적으로 수행하는 것 구현(single core가 parallel 한다 : 병렬)
public class ThreadEx4 {

	public static void main(String[] args) {
		
		long startTime = System.currentTimeMillis(); //현재 시간을 밀리세컨즈 단위로
		
		for(int i=0; i<300; i++) {
			// 기호를 출력하는 수행을 300번 반복 
			System.out.printf("%s", new String("-"));
		}
		System.out.print("소요시간:"+(System.currentTimeMillis()-startTime));	//소요시간: 현재시간 - startTime(시작당시 시간)
	
		System.out.println();
		
		for(int i=0; i<300; i++) {
			// 다른 기호를 출력하는 수행을 300번 반복 
			System.out.printf("%s", new String("|"));
		}
		System.out.print("소요시간2:"+(System.currentTimeMillis()-startTime));	
	}

	/*
	 * 
	 
-----------------------------------------------------------------------
-----------------------------------------------------------------------
-----------------------------------------------------------------------
-----------------------------------------------------------------------
----------------소요시간:72
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
||||||||||||||||소요시간2:87
	
	 * */
}
